Repository: 8bitgeek/clip-itk
Catalog: clip/locale.po/*.KOI8-R/cliprt.po
Languages: ru_ru

source: Open error
ru_ru: Ошибка открытия

source: Bad alias
ru_ru: Неизвестный алиас

source: No such field
ru_ru: Нет поля

source: Workarea not in use
ru_ru: Рабочая область не активна

source: No alias
ru_ru: Нет алиаса

source: No controlling order
ru_ru: Нет управляющего ордера

source: Bad FOR expression
ru_ru: Неправильное выражение FOR

source: No driver linked: %s
ru_ru: Нет подлинкованного драйвера: %s

source: no namespace %lx
ru_ru: нет рабочей области %lx

source: no namespace var %lx
ru_ru: нет переменной пространства имен %lx

source: Alias already in use: %s
ru_ru: Алиас уже используется: %s

source: got debug signal %d
ru_ru: получен сигнал отладчика %d

source: debug: cannot open debug input '%s': %s
ru_ru: отладчик: невозможно открыть ввод '%s': %s

source: debug: cannot open debug output '%s': %s
ru_ru: отладчик: невозможно открыть выход '%s': %s

source: sigint: file %s line %d proc %s
ru_ru: sigint: файл %s строка %d процедура %s

source: dbg read cmd: %s
ru_ru: dbg прочитана команда: %s

source: breakpoint reached: file %s line %d proc %s
ru_ru: достигнута точка останова: файл %s строка %d процедура %s

source: watchpoint reached: expr '%s' file %s line %d proc %s
ru_ru: достигнута точка просмотра: выражение '%s' файл %s строка %d процедура %s

source: process dbg cmd: '%s'
ru_ru: обработка команды отладчика: '%s'

source: find dbg cmd: '%s', %d argc
ru_ru: найдена команда отладчика: '%s', %d argc

source: end cmd: '%s'
ru_ru: окончена команда: '%s'

source: init screen: %s
ru_ru: инициализация экрана: %s

source: exit
ru_ru: выход

source: start
ru_ru: старт

source: process LANG environ '%s/%s'
ru_ru: обработка переменной окружения LANG '%s/%s'

source: process CHARSET environ '%s/%s'
ru_ru: обработка переменной окружения CHARSET '%s/%s'

source: process TERM environ '%s/%s'
ru_ru: обработка переменной окружения TERM %s/%s

source: load charset tables '%s'
ru_ru: загрузка таблиц кодировки '%s'

source: set stream io translation %s -> %s
ru_ru: установка трансляции потокового ввода-вывода %s -> %s

source: cannot load charset file '%s': %s
ru_ru: невозможно загрузить файл кодировки '%s': %s

source: got signal %s, exiting...
ru_ru: получен сигнал %s, выход...

source: trace: file '%s' line %d
ru_ru: трассировка: файл '%s' строка %d

source: C call: proc '%s' file '%s' line %d
ru_ru: C вызов: процедура '%s' файл '%s' строка %d

source: %s: systerm errorblock: runtime error: %s
ru_ru: %s: системный errorblock: ошибка времени выполнения: %s

source: trace: %s
ru_ru: трассировка: %s

source: %s: errorblock nested too deep (%d):
ru_ru: %s: errorblock вложен слишком глубоко (%d):

source: C call from: proc '%s' file '%s' line %d
ru_ru: C вызов от: процедура '%s' файл '%s' строка %d

source: C return=%d to: proc '%s' file '%s' line %d
ru_ru: C return=%d to: процедура '%s' файл '%s' строка %d

source: clip_eval: non-code argument
ru_ru: clip_eval: не-кодовый аргумент

source: call by name not from CHARACTER_t or NUMERIC_t value
ru_ru: вызов по имени не из CHARACTER_t или NUMERIC_t значения

source: non-logical type in NOT operator
ru_ru: нелогический тип в операции NOT

source: non-numeric type in MINUS operator
ru_ru: нечисловой тип в операции MINUS

source: macro assign with non-character argument (%s)
ru_ru: макро присваивание с нестрочным аргументом (%s)

source: no variable name: '%.*s'
ru_ru: нет имени переменной '%.*s'

source: non-logical var in condition
ru_ru: нелогический тип в условии

source: no memvar variable '%s'
ru_ru: нет переменной '%s'

source: no variable '%s'
ru_ru: нет переменной '%s'

source: try access to unknown public var '%s'
ru_ru: попытка доступа к неизвестной public переменной '%s'

source: invalid arguments for '%s' operation
ru_ru: неправильные аргументы для операции '%s'

source: invalid arguments
ru_ru: неправильные аргументы

source: adel for non-array object
ru_ru: adel для не-массива

source: index for adel is out-of range: ind=%d, count=%d
ru_ru: индекс для adel вне допустимого диапазона: ind=%d, count=%d

source: asize for non-array object
ru_ru: asize для не-массива

source: index for asize is out-of range: ind=%d, count=%d
ru_ru: индекс для asize вне допустимого диапазона: ind=%d, count=%d

source: ains for non-array object
ru_ru: ains для не-массива

source: index for ains is out-of range: ind=%d, count=%d
ru_ru: индекс для ains вне допустимого диапазона ind=%d, count=%d

source: aget for non-array object
ru_ru: aget для не-массива

source: index for aget is out-of range: ind=%d, count=%d
ru_ru: индекс для aget вне допустимого диапазона: ind=%d, count=%d

source: aset for non-array object
ru_ru: aset для не-массива

source: index for aset is out-of range: ind=%d, count=%d
ru_ru: индекс для aset вне допустимого диапазона: ind=%d, count=%d

source: madd for non-map object
ru_ru: madd для не-map объекта

source: mdel for non-map object
ru_ru: mdel для не-map объекта

source: mind for non-map object
ru_ru: mind для не-map объекта

source: try fetch element from non-array object%s%s
ru_ru: попытка доступа к элементу не-массива %s%s

source: map fetch error: index %s
ru_ru: ошибка доступа к map: индекс %s

source: out-of-bounds array %s, index=%d, count=%d
ru_ru: индекс вне диапазона: массив %s, индекс=%d, размер=%d

source: map/array fetch error
ru_ru: ошибка доступа к элементу map/array

source: undefined macro-variable in string
ru_ru: неопределенная макро-переменная в строке

source: non-character result of macro in string
ru_ru: не-строчный результат макро в строке

source: macro operation with non-character argument (%s)
ru_ru: макро операция с несимвольным аргументом (%s)

source: no method %s
ru_ru: нет метода %s

source: method %s is not code
ru_ru: метод %s не является выполнимым кодом

source: invalid type in INCR/DECR operation
ru_ru: неправильный тип в операции INCR/DECR

source: %s: runtime error: %s
ru_ru: %s: ошибка времени выполнения: %s

source: unknown error
ru_ru: неизвестная ошибка

source: invalid argument
ru_ru: неправильный аргумент

source: bound error
ru_ru: ошибка выхода за границы

source: string too long
ru_ru: слишком длинная строка

source: number too big
ru_ru: слишком большое число

source: divide by zero
ru_ru: деление на ноль

source: number error
ru_ru: ошибка операции с числом

source: syntax error
ru_ru: синтаксическая ошибка

source: syntax too complex
ru_ru: синтаксис слишком сложен

source: memory error
ru_ru: ошибка памяти

source: no function
ru_ru: нет функции

source: no method
ru_ru: нет метода

source: no variable
ru_ru: нет переменной

source: no alias
ru_ru: нет алиаса

source: no varmethod
ru_ru: нет метода переменной

source: create error
ru_ru: ошибка создания

source: open error
ru_ru: ошибка открытия

source: close error
ru_ru: ошибка закрытия

source: read error
ru_ru: ошибка чтения

source: write error
ru_ru: ошибка записи

source: print error
ru_ru: ошибка печати

source: unsupported
ru_ru: не поддерживается

source: limit exhaust
ru_ru: лимит исчерпан

source: corruption detected
ru_ru: обнаружено разрушение данных

source: wrong datatype
ru_ru: неправильный тип данных

source: wrong datawidth
ru_ru: неправильная ширина данных

source: no table
ru_ru: нет таблицы

source: no order
ru_ru: нет ордера

source: share violation
ru_ru: ошибка разделения доступа

source: unlocked
ru_ru: разблокировано

source: readonly
ru_ru: только чтение

source: appendlock
ru_ru: блокировки добавления

source: bad alias
ru_ru: неправильный алиас

source: locking error
ru_ru: ошибка блокирования

source: macro reference with non-character argument (%s)
ru_ru: макро-ссылка с несимвольным аргументом (%s)

source: translate_charset: cannot load charset file '%s': %s
ru_ru: translate_charset: невозможно загрузить файл кодировки '%s': %s

source: stack check failed at line %d file %d
ru_ru: проверка стека не прошла на строке %d файл %d

source: cannot stat file '%s': %s
ru_ru: невозможно получить статус файла '%s': %s

source: is not regular file '%s'
ru_ru: не регулярный файл '%s'

source: is not pobj file '%s'
ru_ru: не pobj файл '%s'

source: open file '%s' error: %s
ru_ru: открытие файла '%s' ошибка: %s

source: mmap file '%s' error: %s
ru_ru: mmap файл '%s' ошибка: %s

source: read file '%s' error: %s
ru_ru: чтение файла '%s' ошибка: %s

source: '%s' is not valid pobj file: invalid magic
ru_ru: '%s' неправильный pobj файл: неправильное magic-число

source: shared loading problem: %s: file %s
ru_ru: ошибка разделяемой загрузки %s: файл %s

source: shared '%s' fetch name '%s' problem: %s
ru_ru: разделяемый ресурс '%s' имя доступа'%s' проблема: %s

source: unknown file type: '%s'
ru_ru: неизвестный тип файла: '%s'

source: cannot load file: '%s'
ru_ru: невозможно загрузить файл: '%s'

source: PCODE call from: proc '%s' file '%s' line %d
ru_ru: PCODE call from: процедура '%s' файл '%s' строка %d

source: PCODE return=%d to: proc '%s' file '%s' line %d
ru_ru: PCODE return=%d to: процедура '%s' файл '%s' строка %d

source: PCODE call: proc '%s' file '%s' line %d
ru_ru: PCODE call: процедура '%s' файл '%s' строка %d

source: invalid bytecode %d
ru_ru: неправильный байткод %d

source: Cannot take io permissons: %s
ru_ru: Невозможно получить права ввода/вывода: %s

source: DBGCONNECT: cannot create FIFO '%s': %s
ru_ru: DBGCONNECT: невозможно прочитать FIFO '%s': %s

source: fifo %s created successfully
ru_ru: fifo %s успешно создан

source: DBGCONNECT: cannot send signal SIGUSR1 to pid %lu: %s
ru_ru: DBGCONNECT: невозможно послать сигнал SIGUSR1 процессу %lu: %s

source: signal SIGUSR1 sent to pid %lu
ru_ru: сигнал SIGUSR1 послан процессу %lu

source: DBGCONNECT: cannot open FIFO '%s': %s
ru_ru: DBGCONNECT: невозможно открыть FIFO '%s': %s

source: fifo %s opened for writing
ru_ru: fifo %s открыта на запись

source: fifo %s opened for reading
ru_ru: fifo %s открыта на чтение

source: DBGCOMMAND: cannot read data
ru_ru: DBGCOMMAND: невозможно прочитать данные

source: DBGCOMMAND: no connection
ru_ru: DBGCOMMAND: нет соединения

source: DBGCOMMAND: cannot send signal to PID %lu
ru_ru: DBGCOMMAND: невозможно послать сигнал процессу %lu

source: add locale '%s'
ru_ru: добавлена локаль '%s'

source: localed msg: %s -> %s: %.*s -> %.*s
ru_ru: локализированная строка: %s -> %s: %.*s -> %.*s

source: locale msg: %s -> %s: %s
ru_ru: локализированная строка: %s -> %s: %s

source: locale msg plural(%ld:%lu): %s -> %s: %s
ru_ru: локализированная строка (множественное число): %s -> %s: %s

source: no access to file '%s': not a regular file
ru_ru: нет доступа к файлу '%s': не регулярный файл

source: no access to file '%s': %s
ru_ru: нет доступа к файлу '%s': %s

source: locale settings not found for module '%s'
ru_ru: установки локали не найдены для модуля '%s'

source: no access to locale file '%s': %s
ru_ru: нет доступа к файлу локали '%s': %s

source: cannot open locale file '%s': %s
ru_ru: невозможно открыть файл локали. '%s': %s

source: open locale file '%s', charset '%s'
ru_ru: открыт файл локали '%s', кодировка '%s'

source: cannot stat locale file '%s': %s
ru_ru: невозможно получить статус файла локали '%s': %s

source: cannot read locale file '%s': %s
ru_ru: невозможно прочитать файл локали '%s': %s

source: wrong magic number of locale file '%s'
ru_ru: неправильный magic number в файле локали '%s'

source: illegal revision of locale file '%s': %d
ru_ru: неправильная редакция файла локали '%s': %d

source: runtime codeblock compiler: '%.*s': %s
ru_ru: runtime компилятор кодового блока: '%.*s': %s

source: close printer:%s
ru_ru: закрыт принтер:%s

source: set print to:%s,%s
ru_ru: установка печати в:%s,%s

source: cannot open printer file '%s': %s
ru_ru: невозможно открыть файл принтера '%s': %s

source: set printer translation %s -> %s
ru_ru: установлена трансляция для принтера %s -> %s

source: task_run: cannot start function '%s'
ru_ru: task_run: невозможно стартовать функцию '%s'

source: TASK sheduler not implemented for OS %s
ru_ru: TASK планировщик не реализован для OS %s

source: BREAK function requare argument
ru_ru: BREAK функция требует аргумент

source: PROCNAME: invalid call level '%d'
ru_ru: PROCNAME: неправильный уровень вызова '%d'

source: FILENAME: invalid call level '%d'
ru_ru: FILENAME: неправильный уровень вызова '%d'

source: COMPILE: non-character parameter
ru_ru: COMPILE: несимвольный параметр

source: block2str: non-pcode parameter
ru_ru: block2str: некодовый параметр

source: no name given
ru_ru: нет имени

source: ELF '%s' loading problem: %s
ru_ru: ELF '%s' ошибка загрузки %s

source: Unknown data type or bad size of item
ru_ru: Неизвестный тип или неправильный размер данных

source: Bad BTREE handle
ru_ru: Неправильный дескриптор BTREE

source: Internal error in BTREE module
ru_ru: Внутренняя ошибка в модуле BTREE

source: MAX_BTREE_DEEP exceeded
ru_ru: превышен MAX_BTREE_DEEP

source: CDX internal error: bad root page
ru_ru: внутренняя ошибка CDX : неправильная коренная страница

source: CDX internal error: bad leaf page
ru_ru: внутренняя ошибка CDX : неправильная листовая страница

source: CDX internal error: no keys on the page
ru_ru: внутненняя ошибка CDX: нет ключей на странице

source: Bad header
ru_ru: неправильный заголовок

source: No such tag
ru_ru: неизвестный тэг

source: Bad data
ru_ru: неправильные данные

source: Bad WHILE expression
ru_ru: неправильное выражение WHILE

source: Bad EVAL expression
ru_ru: неправильное выражение EVAL

source: Unlock error
ru_ru: ошибка разблокирования

source: Shared lock error
ru_ru: ошибка блокировки разделяемого доступа

source: Exclusive lock error
ru_ru: ошибка блокировки исключительного доступа

source: Table header corrupted
ru_ru: заголовок страницы разрушен

source: Bad table structure
ru_ru: неправильная структура таблицы

source: Duplicate field name
ru_ru: имя поля определено дважды

source: Operation not permitted
ru_ru: операция не разрешена

source: Corruption detected
ru_ru: обнаружено разрушение данных

source: Memo file not opened
ru_ru: Memo файл не открыт

source: Type mismatch
ru_ru: несоответствие типов

source: I/O error
ru_ru: ошибка ввода/вывода

source: Index corrupted
ru_ru: разрушение индекса

source: Key length is too long
ru_ru: слишком большая длина ключа

source: Not CTX file (bad signature): %s
ru_ru: не CTX файл (неправильная сигнатура): %s

source: Bad RDD instance
ru_ru: неправильный объект RDD

source: Bad filter expression
ru_ru: неправильное выражение фильтра

source: Bad relation expression
ru_ru: неправильное выражение связи

source: Bad field
ru_ru: неправильное поле

source: No data file driver linked: %s
ru_ru: нет драйвера файла данных: %s

source: No index file driver linked: %s
ru_ru: нет драйвера индексного файла: %s

source: No memo file driver linked: %s
ru_ru: нет драйвера memo файл: %s

source: no item DBF_CHARSET, revert to KOI charset
ru_ru: нет элемента DBF_CHARSET, используется кодировка KOI8-R

source: dbf: cannot determine host charset, revert to koi_locale
ru_ru: dbf: невозможно определить кодировку хоста, используется koi_locale

source: load host charset '%s'
ru_ru: загрузка кодировки хоста '%s'

source: dbf: cannot load charset '%s': %s, revert to koi_locale
ru_ru: dbf: невозможно загрузить кодировку '%s': %s, используем koi_locale

source: load dbf charset '%s'
ru_ru: загрузка кодировки dbf '%s'

source: Bad argument (2)
ru_ru: неправильный аргумент(2)

source: Bad filter handle
ru_ru: неправильный дескриптор фильтра

source: Invalid join type
ru_ru: неправильный тип соединения

source: Not memo field
ru_ru: не мемо-поле

source: Create file error
ru_ru: ошибка создания файла

source: Open file error
ru_ru: ошибка открытия файла

source: File write error
ru_ru: ошибка записи файла

source: File read error
ru_ru: ошибка чтения файла

source: Bad .flt file
ru_ru: неправильный .flt файл

source: set out translation: %s -> %s
ru_ru: установлена выходная трансляция: %s -> %s

source: got xterm mouse event: type=%d y=%d x=%d buttons=%d clicks=%d
ru_ru: получено событие xterm mouse: type=%d y=%d x=%d buttons=%d clicks=%d
