Repository: 8bitgeek/clip-itk
Catalog: doc/po/doc/langext.sgml/*.po
Languages: ru

source: Language extensions
ru: Расширения языка

source: Introduction
ru: Введение

source: CLIP is a <emphasis>Clipper</emphasis> compiler, in other words it understands the <emphasis>standard Clipper syntax</emphasis>. For lack of the documentation on CLIP language (it's under construction at present), refer to the Clipper manuals. Only language extensions are considered here.
ru: CLIP является компилятором <emphasis>Clipper</emphasis>, другими словами он понимает <emphasis>стандартный синтаксис Clipper</emphasis>. За неимением документации по языку CLIP (в данный момент находится в разработке), обращайтесь к руководству по Clipper. Здесь рассматриваются лишь расширения языка, реализованный в CLIP.

source: SWITCH statement
ru: Оператор SWITCH

source: <command>SWITCH</command> statement is a control structure that executes one of several blocks of the statements depending on the value of an expression.
ru: Оператор <command>SWITCH</command> является управляющей структурой, которая выполняет блок операторов в зависимости от значения выражения.

source: Syntax:
ru: Синтаксис:

source: It evaluates <emphasis><![CDATA[<expression>]]></emphasis>, looks for it's value in <emphasis>CASE</emphasis> constants, and executes associated block of statements. If none of the <emphasis>CASE</emphasis> constants are equal to the expression value, it executes the block of statements following the <emphasis>OTHERWISE</emphasis> statement (if exist).
ru: Оператор вычисляет <emphasis><![CDATA[<expression>]]></emphasis>, ищет вычисленное значение среди констант, указанных в операторах <emphasis>CASE</emphasis>, и выполняет соответствующий блок операторов. Если вычисленное значение среди констант не найдено, выполняется блок операторов, следующий за оператором <emphasis>OTHERWISE</emphasis> (если есть).

source: Only numeric and character constants are allowed in <emphasis>CASE</emphasis> statement.
ru: В операторах <emphasis>CASE</emphasis> разрешается использование только числовых и символьных констант.

source: <command>SWITCH</command> is more effective than similar <command>DO CASE</command> statement.
ru: Оператор <command>SWITCH</command> более эффективен, чем похожий оператор <command>DO CASE</command>.

source: Assign of the reference
ru: Присвоение по ссылке

source: New operator <command>:=@</command> is used with the following syntax:
ru: Новая операция <command>:=@</command> используется в следующем синтаксисе:

source: It assigns <![CDATA[<rVar>]]> variable to the <![CDATA[<lVar>]]> variable by reference, i.e. <![CDATA[<lVar>]]> becomes a reference to (synonym of) <![CDATA[<rVar>]]>. <![CDATA[<rVar>]]> can be of any data type, including function reference. For example:
ru: Эта операция присваивает переменную <![CDATA[<rVar>]]> переменной <![CDATA[<lVar>]]> по ссылке, т.е. <![CDATA[<lVar>]]> становится ссылкой на (синонимом) <![CDATA[<rVar>]]>. <![CDATA[<rVar>]]> может быть любого типа, в том числе ссылкой на функцию. Например:

source: Support FoxPro style for array access
ru: Поддержка FoxPro стиля для доступа к элементам массива

source: Support call codeblock via function
ru: Вызов кодовых блоков как функций

source: construction call memvar defined codeblock if function with name "cb" not exist.
ru: вызывается кодовый блок, объявленный как memvar. если не найдена функция с именем "cb".

source: Hexadecimal constants
ru: Шестнадцатеричные константы

source: CLIP understands hexadecimal constants as C does. For example <command>0x10</command> (decimal 16), <command>0xff</command> (decimal 255).
ru: CLIP понимает шестнадцатеричные константы, как C. Например <command>0x10</command> (десятичное 16), <command>0xff</command> (десятичное 255).

source: Rational arithmetic
ru: Рациональная арифметика

source: CLIP supports rational numbers with unlimited precision. To realize this possibility, it's necessary to write somewhere in program
ru: CLIP поддерживает использование рациональных чисел с неограниченной точностью. Чтобы воспользоваться этой возможностью нужно написать где-нибудь в программе

source: or via the command described in <command>clip.ch</command>
ru: или в виде команды, описанной в <command>clip.ch</command>

source: The compiler does not support large numbers as constants, that is, when using expressions like
ru: Компилятор не поддерживает константы - длинные числа, то есть при использовании подобного выражения

source: Associative arrays
ru: Ассоциативные массивы

source: <emphasis>Associative array (AA)</emphasis> - is an array which elements are accessed by <emphasis>associated</emphasis> character strings. Let's consider associative array in contrast of an ordinary array. An ordinary array may be written as follows:
ru: <emphasis>Ассоциативный массив (АМ)</emphasis> - это массив для доступа к элементам которого используются <emphasis>ассоциативные</emphasis> строки. Рассмотрим ассоциативные массивы в сравнении с обычными массивами. Обычный массив выглядит следующим образом:

source: To be honest, elements of associative array are identified by a <emphasis>hash codes</emphasis> of strings. Hash code is the number as a result of hashing a string to a number by using bit operations. For strings of less than 20 characters, the probability of coincidence of hash codes is approximately 1/1000000. For longer strings, the probability is increased.
ru: Если быть точнее, элементы ассоциативного массива идентифицируются <emphasis>хэш-кодами</emphasis> строк. Хэш-код - это число, получаемое путем хэширования строки с использованием битовых операций. Для строк длиной до 20 символов, вероятность совпадения хэш-кодов двух различных строк равна приблизительно 1/1000000. Для более длинных строк, вероятность увеличивается.

source: The compiler calculates hash codes of strings enclosed in "`" characters. For example:
ru: Компилятор вычисляет хэш-коды строк заключенных в символы "`". Например:

source: Also, compiler calculates hash codes of strings with <emphasis>hash_</emphasis> prefix. In this case, the string is not converted to upper case. You should do it yourself:
ru: Компилятор также вычисляет хэш-коды строк с префиксом <emphasis>hash_</emphasis>. В этом случае строки не переводятся к верхнему регистру. Вы должны делать это сами:

source: Pay attention to <emphasis>QWER</emphasis> which is written in upper case, because compiler does not distinguish letter cases.
ru: Обратите внимание что <emphasis>QWER</emphasis> большими буквами, потому что компилятор не чувствителен к регистру символов.

source: Also, the associate array is characterized by a very fast access to elements, because necessary element is actually searched in a hash table.
ru: Ассоциативный массив характеризуется быстрым доступом к элементам.

source: FOR ... IN statement
ru: Оператор FOR ... IN

source: <command>FOR ... IN</command> statement is a control structure that executes a block of statements for all elements of an associative array.
ru: Оператор <command>FOR ... IN</command> - это управляющая структура, которая исполняет блок операторов для каждого элемента ассоциативного массива.

source: Syntax:
ru: Синтаксис:

source: Before processing the block of statements, <emphasis><![CDATA[<element>]]></emphasis> variable takes value of the next element of <emphasis><![CDATA[<associative_array>]]></emphasis>.
ru: Перед выполнением блока операторов, переменная <emphasis><![CDATA[<element>]]></emphasis> принимает значение очередного элемента <emphasis><![CDATA[<associative_array>]]></emphasis>.

source: Another syntax of <command>FOR ... IN</command> statement allows to execute a block of statements for hash codes identifying all elements of an associative array:
ru: Другой синтаксис оператора <command>FOR ... IN</command> позволяет выполнять блок операторов для хэш-кодов каждого элемента ассоциативного массива:

source: For example
ru: Например

source: Strings as arrays
ru: Строки как массивы

source: C-style syntax could be used for accessing substrings in CLIP:
ru: В CLIP можно использовать синтаксис в стиле C для доступа к подстрокам:

source: where <![CDATA[<pos>]]> is the start position of the substring, <![CDATA[<length>]]> is the length of the substring, 1 by default.
ru: где <![CDATA[<pos>]]> - начальная позиция подстроки, <![CDATA[<length>]]> - длина подстроки, по умолчанию 1.

source: could be written as
ru: может быть написано как

source: OO model
ru: ОО модель

source: Introduction in OO model
ru: Введение в ОО модель

source: Firstly, some words about CA-Clipper built-in OO model. Its OO is based on ordinary array, and any call like
ru: Во первых, несколько слов об ОО модели, встроенной в CA-Clipper. Она основана на использовании обычных массивов и любой вызов, подобный

source: or
ru: или

source: results in the situation when in <emphasis>obj</emphasis> array there is searching of an element whose first element coincides with attribute or method name, and such search is executed linearly and is practically analogues to
ru: приводит к тому, что в массиве <emphasis>obj</emphasis> производится поиск элемента, у которого первый элемент совпадает с именем атрибута или метода, причем такой поиск производится линейно и практически является аналогом функции

source: function, which greatly reduces the efficiency of OO model of pure CA-Clipper. This, of course, is rather a simplified explanation, but the sense is still that as described.
ru: что естественно очень плохо сказывается на производительности ОО-модели CA-Clipper. Это конечно упрощенное описание, но смысл остается такой же.

source: We believe, now it's clear for what purpose association arrays were made. OO model based on association arrays is faster by an order.
ru: Теперь должно быть понятно для чего предназначены ассоциативные массивы. ОО модель, основанная на ассоциативных массивах производительнее на порядок.

source: At the same time, there's no need in expressions like
ru: При этом исчезает необходимость в конструкциях

source: and in <emphasis>TClass</emphasis> class itself, which raises OO model efficiency.
ru: и в самом классе <emphasis>TClass</emphasis>, что ещеувеличивает производительность.

source: How could you make your own class? It's very simple:
ru: Как сделать свой класс? Очень просто:

source: Also, we'd like to add two simple rules:
ru: Хотелось бы еще добавить два простых правила:

source: The attribute is created when something, including NIL, is assigned to it.
ru: Атрибут рождается при первом присвоении в него чего-нибудь, в том числе и NIL.

source: At any moment in run-time,the method can assign or reassign any function announced in this module as static function, or can adopt this function from another object, as a usual assignment of values:
ru: Методом можно назначить или переназначить в любой момент любую функцию, объявленную как static в этом же .prg модуле,либо наследовать его от другого объекта, как обычное присвоение значений:

source: In what way can objects be used? As in CA-Clipper, or even more simply:
ru: Как использовать объекты? Так же как и в CA-Clipper:

source: In an object, <command>destroy()</command> method can be announced, but it isn't quite destructor, which is usual in languages of the third generation. There is a local <emphasis>obj</emphasis> variable, and this is just an object. Upon leaving the function body, this variable, along with all its data, is destroyed. Now, let's consider the case of an object having an attribute
ru: В объекте можно объявить метод <command>destroy()</command>, но это не совсем деструктор, как это принято в языках 3 поколения. Есть переменная <emphasis>obj</emphasis> и в ней лежит объект. При выходе из тела функции эта переменная будет уничтожена со всеми вложенными в ней данными. Теперь рассмотрим ситуацию, в котором у этого объекта есть атрибут

source: When destroying <emphasis>obj</emphasis>, it's necessary to close <emphasis>hFile</emphasis>, but the compiler doesn't know this; the compiler (rather a virtual machine) only knows that in <emphasis>hFile</emphasis> there's a number and will destroy the number only, but the file will remain open. Just for such purposes <command>destroy()</command> is intended, and it'll called (if it exists ) before destroying <emphasis>obj</emphasis> variable.
ru: При уничтожении <emphasis>obj</emphasis> необходимо закрыть <emphasis>hFile</emphasis>, но компилятор (точнее виртуальная CLIP-машина), не знает этого. Он знает только что <emphasis>hFile</emphasis> - это число, и уничтожает только это число, а файл остается открытым. Для подобных случаев и предназначен метод <command>destroy()</command>, который вызывается (если есть) перед уничтожением переменной <emphasis>obj</emphasis> виртуальной CLIP-машиной.

source: Control of change attributes
ru: Контроль за изменением атрибутов

source: If it's necessary to control changes of object attributes, make <command>modify()</command> method and invoke
ru: Если надо контролировать изменения атрибутов объекта, то сделайте метод <command>modify()</command> и установите

source: <command>modify()</command> method is called before changing value of any object attribute. Two parameters are passed to <command>modify()</command>: hash code of attribute to be changed and new value to be assigned to it. <command>modify()</command> should return the value to assign to the attribute. For example:
ru: Метод <command>modify()</command> вызывается перед изменением значения любого атрибута объекта. Ему передается два параметра: хэш-код изменяемого атрибута и его новое значение. <command>modify()</command> должен вернуть значение, которое затем присвоится атрибуту. Например:

source: Recovering/reviving objects
ru: Регенерация объектов

source: CLIP is able to store the data of any type to MEMO fields, including objects. But there is no way to store object methods (methods can be changed).
ru: CLIP способен хранить данные любых типов в мемо-полях, в том числе и объекты. Но методы объекта не сохраняются (потому что нет смысла хранить код с каждым экземпляром, да и методы имеют тенденцию к изменению).

source: Recovering is made with the following steps: data are decoded; if data are of <emphasis>object</emphasis> type and object have <emphasis>CLASSNAME</emphasis> attribute then called function <emphasis><![CDATA[_recover_&(var:CLASSNAME)(var)]]></emphasis>. This function must assign this object methods.
ru: Восстановление объекта производится следующим образом: данные раскодируются, и если объект имеет атрибут <emphasis>CLASSNAME</emphasis> вызывается функция <emphasis><![CDATA[_recover_&(var:CLASSNAME)(var)]]></emphasis>. Эта функция должна восстановить методы объекта.

source: This feature can be used to send object as string via e-mail or TCP :)
ru: Этим же механизмом можно пользоваться и для передачи объектов в виде строки. Например по почте или TCP-соединению :)

source: Here is an example of using this feature:
ru: Вот пример использования механизма регенерации объектов:

source: Overloading operators for objects
ru: Перегрузка операций

source: CLIP supports overloading of the operations. Operations that can be overloaded and corresponding <emphasis>operator</emphasis> methods are listed in the table below.
ru: CLIP поддерживает перегрузку операций для объектов. Перегружаемые операции и соответствующие имена методов перечислены в следующей таблице.

source: Overloaded operations
ru: Перегружаемые операции

source: Operation
ru: Операция

source: Method
ru: Метод

source: Here is an example of using operations overloading.
ru: Вот пример использования перегрузки операций.

source: Conclusion
ru: Заключение

source: Due to such OO model and compiling into C-program, there appears a possibility to write TBrowse and Get standard classes in Clipper itself. At the same time, the efficiency of these classes is not worse than those written in pure C in CA-Clipper.
ru: Благодаря такому устройству ОО-модели и возможности компилировать быстрый код посредством трансляции в С-программу, появилась возможность написать стандартные классы TBrowse, Get на самом CA-Clipper.При этом визуально производительность этих классов не хуже, чем написанные на чистом C в стандартном CA-Clipper.
