Repository: 8bitgeek/clip-itk
Catalog: clip/locale.po/*.8859-1/cliprt.po
Languages: es_es

source: Bad alias
es_es: Alias inválido

source: No such field
es_es: No existe el campo

source: Workarea not in use
es_es: Area de trabajo inactiva

source: No alias
es_es: No hay alias

source: No controlling order
es_es: No hay orden de control

source: Bad FOR expression
es_es: Expresión FOR inválida

source: No driver linked: %s
es_es: Driver no enlazado: %s

source: no namespace %lx
es_es: ámbito de nombre %lx no existe

source: no namespace var %lx
es_es: ámbito de nombre de variable %lx no existe

source: Alias already in use: %s
es_es: Alias actualmente en uso: %s

source: got debug signal %d
es_es: obtenida señal de depuración %d

source: debug: cannot open debug input '%s': %s
es_es: depuración: no se puede abrir entrada de depuración '%s': %s

source: debug: cannot open debug output '%s': %s
es_es: depuración: no se puede abrir salida de depuración '%s': %s

source: sigint: file %s line %d proc %s
es_es: sigint: archivo %s línea %d proc %s

source: dbg read cmd: %s
es_es: dbg leer cmd: %s

source: breakpoint reached: file %s line %d proc %s
es_es: punto de parada alcanzado: archivo %s línea %d proc %s

source: watchpoint reached: expr '%s' file %s line %d proc %s
es_es: punto de observación alcanzado: expr '%s' archivo %s línea %d proc %s

source: process dbg cmd: '%s'
es_es: procesar cmd dbg: '%s'

source: find dbg cmd: '%s', %d argc
es_es: buscar cmd dbg: '%s', %d argc

source: end cmd: '%s'
es_es: fin cmd: '%s'

source: init screen: %s
es_es: inicializando pantalla: %s

source: exit
es_es: saliendo

source: start
es_es: comenzando

source: process LANG environ '%s/%s'
es_es: procesando entorno LANG '%s/%s'

source: process CHARSET environ '%s/%s'
es_es: procesando entorno CHARSET '%s/%s'

source: process TERM environ '%s/%s'
es_es: procesando entorno TERM %s/%s

source: load charset tables '%s'
es_es: cargando tablas de juego de caracteres '%s'

source: set stream io translation %s -> %s
es_es: puesto traducción de flujo e/s %s -> %s

source: cannot load charset file '%s': %s
es_es: no se puede cargar archivo de juego de caracteres '%s': %s

source: got signal %s, exiting...
es_es: obtenida señal %s, terminando...

source: trace: file '%s' line %d
es_es: trazado: archivo '%s' línea %d

source: C call: proc '%s' file '%s' line %d
es_es: llamada C: proc '%s' archivo '%s' línea %d

source: %s: systerm errorblock: runtime error: %s
es_es: %s: errorblock del sistema: error de ejecución: %s

source: trace: %s
es_es: trazado: %s

source: %s: errorblock nested too deep (%d):
es_es: %s: errorblock anidado demasiado profundo (%d):

source: C call from: proc '%s' file '%s' line %d
es_es: llamada C desde: proc '%s' archivo '%s' línea %d

source: C return=%d to: proc '%s' file '%s' line %d
es_es: C retorna=%d a: proc '%s' archivo '%s' línea %d

source: clip_eval: non-code argument
es_es: clip_eval: argumento no-código

source: call by name not from CHARACTER_t or NUMERIC_t value
es_es: llamada por nombre no desde valor CHARACTER_t o NUMERIC_t

source: non-logical type in NOT operator
es_es: tipo no-lógico en operador 'NO'

source: non-numeric type in MINUS operator
es_es: tipo no-numérico en operador 'MENOS'

source: macro assign with non-character argument (%s)
es_es: asignación de macro con argumento no-caracter (%s)

source: no variable name: '%.*s'
es_es: no hay nombre de variable '%.*s'

source: non-logical var in condition
es_es: variable no-lógica en condición

source: no variable '%s'
es_es: no hay variable '%s'

source: try access to unknown public var '%s'
es_es: intentando acceder a variable pública desconocida '%s'

source: invalid arguments for '%s' operation
es_es: argumentos inválidos para operación '%s'

source: invalid arguments
es_es: argumentos inválidos

source: adel for non-array object
es_es: adel para un objeto no-tabla

source: index for adel is out-of range: ind=%d, count=%d
es_es: índice para adel fuera de rango: ind=%d, cont=%d

source: asize for non-array object
es_es: asize para objeto no-tabla

source: index for asize is out-of range: ind=%d, count=%d
es_es: índice para asize fyera de rango: ind=%d, cont=%d

source: ains for non-array object
es_es: ains para objeto no-tabla

source: index for ains is out-of range: ind=%d, count=%d
es_es: índice para ains fuera de rango: ind=%d, cont=%d

source: aget for non-array object
es_es: aget para objeto no-tabla

source: index for aget is out-of range: ind=%d, count=%d
es_es: índice para aget fuera de rango: ind=%d, cont=%d

source: aset for non-array object
es_es: aset para objeto no-tabla

source: index for aset is out-of range: ind=%d, count=%d
es_es: índice para aset fuera de rango: ind=%d, cont=%d

source: madd for non-map object
es_es: madd para objeto no-map

source: mdel for non-map object
es_es: mdel para objeto no-map

source: mind for non-map object
es_es: mind para objeto no-map

source: try fetch element from non-array object%s%s
es_es: intentando obtener elemento de objeto no-tabla %s%s

source: map fetch error: index %s
es_es: map obtuvo error: índice %s

source: out-of-bounds array %s, index=%d, count=%d
es_es: fuera de límites, tabla %s, índice=%d, cont=%d

source: map/array fetch error
es_es: erros obteniendo map/tabla

source: undefined macro-variable in string
es_es: macro-variable indefinida en cadena de texto

source: non-character result of macro in string
es_es: resultado no-caracter en resultado de macro en cadena de texto

source: macro operation with non-character argument (%s)
es_es: operación macro con argumento no caracter (%s)

source: no method %s
es_es: no hay método %s

source: method %s is not code
es_es: método %s no es código

source: invalid type in INCR/DECR operation
es_es: tipo inválido en operación INCR/DECR

source: %s: runtime error: %s
es_es: %s: error de ejecución: %s

source: unknown error
es_es: error desconocido

source: invalid argument
es_es: argumento inválido

source: bound error
es_es: error de límite

source: string too long
es_es: cadena de texto demasiado larga

source: number too big
es_es: número demasiado grande

source: divide by zero
es_es: división por cero

source: number error
es_es: error de número

source: syntax error
es_es: error de sintaxis

source: syntax too complex
es_es: sintaxis demasiado compleja

source: memory error
es_es: error de memoria

source: no function
es_es: no hay función

source: no method
es_es: no hay método

source: no variable
es_es: no hay variable

source: no alias
es_es: no hay alias

source: no varmethod
es_es: no hay método de variable

source: create error
es_es: error de creación

source: open error
es_es: error de apertura

source: close error
es_es: error de cierre

source: read error
es_es: error de lectura

source: write error
es_es: error de escritura

source: print error
es_es: error de impresión

source: unsupported
es_es: no soportado

source: limit exhaust
es_es: límite exhausto

source: corruption detected
es_es: corrupción detectada

source: wrong datatype
es_es: tipo de datos erróneo

source: wrong datawidth
es_es: tamaño de datos erróneo

source: no table
es_es: no hay base de datos

source: no order
es_es: no hay orden

source: share violation
es_es: error de compartición

source: unlocked
es_es: no bloqueado

source: readonly
es_es: sólo lectura

source: appendlock
es_es: bloqueo de agregado

source: bad alias
es_es: alias inválido

source: macro reference with non-character argument (%s)
es_es: referencia a macro con argumento no-caracter (%s)

source: translate_charset: cannot load charset file '%s': %s
es_es: translate_charset: no se puede cargar archivo '%s': %s

source: stack check failed at line %d file %d
es_es: fallo en chequeo de pila en línea %d archivo %d

source: cannot stat file '%s': %s
es_es: no se puede acceder al archivo '%s': %s

source: is not regular file '%s'
es_es: no es un archivo regular '%s'

source: is not pobj file '%s'
es_es: no es archivo pobj '%s'

source: open file '%s' error: %s
es_es: abriendo archivo '%s' error: %s

source: mmap file '%s' error: %s
es_es: mmap en archivo '%s' error: %s

source: read file '%s' error: %s
es_es: lectura de archivo '%s' error: %s

source: '%s' is not valid pobj file: invalid magic
es_es: '%s' no es un archivo pobj válido: identificación inválida

source: shared loading problem: %s: file %s
es_es: problema de carga dinámica %s: archivo %s

source: shared '%s' fetch name '%s' problem: %s
es_es: dinámica '%s' obtención de '%s' problema: %s

source: unknown file type: '%s'
es_es: tipo de archivo desconocido: '%s'

source: cannot load file: '%s'
es_es: no se puede cargar archivo: '%s'

source: PCODE call from: proc '%s' file '%s' line %d
es_es: llamada PCODE desde: proc '%s' archivo '%s' línea %d

source: PCODE return=%d to: proc '%s' file '%s' line %d
es_es: PCODE retorna=%d a: proc '%s' archivo '%s' línea %d

source: PCODE call: proc '%s' file '%s' line %d
es_es: llamada PCODE: proc '%s' archivo '%s' línea %d

source: invalid bytecode %d
es_es: bytecode inválido %d

source: Cannot take io permissons: %s
es_es: No se puede obtener permiso de e/s: %s

source: DBGCONNECT: cannot create FIFO '%s': %s
es_es: DBGCONNECT: no se puede crear FIFO '%s': %s

source: fifo %s created successfully
es_es: fifo %s creado con éxito

source: DBGCONNECT: cannot send signal SIGUSR1 to pid %lu: %s
es_es: DBGCONNECT: no se puede enviar señal SIGUSR1 al pid %lu: %s

source: signal SIGUSR1 sent to pid %lu
es_es: señal SIGUSR1 enviada al pid %lu

source: DBGCONNECT: cannot open FIFO '%s': %s
es_es: DBGCONNECT: no se puede abrir FIFO '%s': %s

source: fifo %s opened for writing
es_es: fifo %s abierto para escritura

source: fifo %s opened for reading
es_es: fifo %s abierto para lectura

source: DBGCOMMAND: cannot read data
es_es: DBGCOMMAND: no se puede leer datos

source: DBGCOMMAND: no connection
es_es: DBGCOMMAND: no hay conexión

source: DBGCOMMAND: cannot send signal to PID %lu
es_es: DBGCOMMAND: no se puede enviar señal a PID %lu

source: add locale '%s'
es_es: agregada localización '%s'

source: localed msg: %s -> %s: %.*s -> %.*s
es_es: mens localizado: %s -> %s: %.*s -> %.*s

source: locale msg: %s -> %s: %s
es_es: mens de localización: %s -> %s: %s

source: locale msg plural(%ld:%lu): %s -> %s: %s
es_es: mens de localización plural (%ld:%lu): %s -> %s: %s

source: no access to file '%s': not a regular file
es_es: no hay acceso al archivo '%s': no es un archivo regular

source: no access to file '%s': %s
es_es: no hay acceso al archivo '%s': %s

source: locale settings not found for module '%s'
es_es: seteos de localización no encontrados para el módulo '%s'

source: no access to locale file '%s': %s
es_es: no hay acceso al archivo de localización '%s': %s

source: cannot open locale file '%s': %s
es_es: no se puede abrir archivo de localización '%s': %s

source: open locale file '%s', charset '%s'
es_es: abierto archivo de localización '%s', juego de caracteres '%s'

source: cannot stat locale file '%s': %s
es_es: no se puede acceder al archivo de localización '%s': %s

source: cannot read locale file '%s': %s
es_es: no se puede leer archivo de localización '%s': %s

source: wrong magic number of locale file '%s'
es_es: número de identificación erróneo del archivo de localización '%s'

source: illegal revision of locale file '%s': %d
es_es: revisión ilegal del archivo de localización '%s': %d

source: runtime codeblock compiler: '%.*s': %s
es_es: compilador de bloque de código en ejecución: '%.*s': %s

source: close printer:%s
es_es: cerrando impresora: %s

source: set print to:%s,%s
es_es: poniendo impresora a: %s,%s

source: cannot open printer file '%s': %s
es_es: no se puede abrir archivo de impresora '%s': %s

source: task_run: cannot start function '%s'
es_es: task_run: no se puede iniciar función '%s'

source: TASK sheduler not implemented for OS %s
es_es: manejador de TAREAS no implementado para SO %s

source: BREAK function requare argument
es_es: función BREAK requiere argumento

source: PROCNAME: invalid call level '%d'
es_es: PROCNAME: nivel de llamada inválido '%d'

source: FILENAME: invalid call level '%d'
es_es: FILENAME: nivel de llamada inválido '%d'

source: COMPILE: non-character parameter
es_es: COMPILE: parámetro no-caracter

source: block2str: non-pcode parameter
es_es: block2str: parámetro no-pcode

source: no name given
es_es: no se ha dado nombre

source: ELF '%s' loading problem: %s
es_es: ELF '%s' error de carga: %s

source: Unknown data type or bad size of item
es_es: Tipo de datos desconocido o tamaño inválido de item

source: Bad BTREE handle
es_es: Manejador BTREE inválido

source: Internal error in BTREE module
es_es: Error interno en módulo BTREE

source: MAX_BTREE_DEEP exceeded
es_es: MAX_BTREE_DEEP excedido

source: CDX internal error: bad root page
es_es: Error interno CDX: página raíz inválida

source: CDX internal error: bad leaf page
es_es: Error interno CDX: página hoja inválida

source: CDX internal error: no keys on the page
es_es: Error interno CDX: no hay claves en la página

source: Bad header
es_es: Cabecera inválida

source: No such tag
es_es: Rótulo inexistente

source: Bad data
es_es: Datos inválidos

source: Bad WHILE expression
es_es: Expresión WHILE inválida

source: Bad EVAL expression
es_es: Expresión EVAL inválida

source: Unlock error
es_es: Error de desbloqueo

source: Shared lock error
es_es: Error de bloqueo compartido

source: Exclusive lock error
es_es: Error de bloqueo exclusivo

source: Table header corrupted
es_es: Cabecera de tabla corrupta

source: Bad table structure
es_es: Estructura de tabla inválida

source: Operation not permitted
es_es: Operación no permitida

source: Corruption detected
es_es: Corrupción detectada

source: Memo file not opened
es_es: Archivo Memo no abierto

source: Type mismatch
es_es: Tipos no coincidentes

source: I/O error
es_es: Error de E/S

source: Index corrupted
es_es: Indice corrupto

source: Key length is too long
es_es: Longitud de clave demasiado larga

source: Not CTX file (bad signature): %s
es_es: No es un archivo CTX (marca inválida): %s

source: Bad RDD instance
es_es: Estancia RDD inválida

source: Bad filter expression
es_es: Expresión de filtro inválida

source: Bad relation expression
es_es: Expresión de relación inválida

source: Bad field
es_es: Campo inválido

source: No data file driver linked: %s
es_es: No hay manejador enlazado para archivo de datos: %s

source: No index file driver linked: %s
es_es: No hay manejador enlazado para archivo índice: %s

source: No memo file driver linked: %s
es_es: No hay manejador enlazado para archivo memo: %s

source: no item DBF_CHARSET, revert to KOI charset
es_es: No hay item DBF_CHARSET, volviendo a juego de caracteres KOI8-R

source: dbf: cannot determine host charset, revert to koi_locale
es_es: dbf: no se puede determinar juego de caracteres del ordenador, volviendo a koi_locale

source: load host charset '%s'
es_es: cargando juego de caracteres del ordenador '%s'

source: dbf: cannot load charset '%s': %s, revert to koi_locale
es_es: dbf: no se puede cargar juego de caracteres '%s': %s, volviendo a koi_locale

source: load dbf charset '%s'
es_es: cargando juego de caracteres dbf '%s'

source: Bad argument (2)
es_es: Argumento inválido (2)

source: Bad filter handle
es_es: Manejador de filtro inválido

source: Invalid join type
es_es: Tipo de unión inválida

source: Not memo field
es_es: No es campo memo

source: Create file error
es_es: Error de creación de archivo

source: Open file error
es_es: Error de apertura de archivo

source: File write error
es_es: Error de escritura de archivo

source: File read error
es_es: Error de lectura de archivo

source: Bad .flt file
es_es: Archivo .flt inválido

source: set out translation: %s -> %s
es_es: puesta traducción de salida: %s -> %s

source: got xterm mouse event: type=%d y=%d x=%d buttons=%d clicks=%d
es_es: obtenido evento de ratón xterm: tipo=%d y=%d x=%d botones=%d clicks=%d

source: got xterm rawmode mouse event: type=%d y=%d x=%d xt_buttons=%d buttons=%d clicks=%d
es_es: obtenido evento de ratón xterm modo plano: tipo=%d y=%d x=%d botones_xt=%d botones=%d clicks=%d

source: got gp_get_event: %d type=%d y=%d x=%d buttons=%d m_buttons=%d
es_es: obtenido gp_get_event: %d tipo=%d y=%d x=%d botones=%d botones_m=%d

source: Gpm_Open return %d
es_es: Gpm_Open retorna %d
